In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("datasets_11657_16098_train.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
from sklearn import preprocessing

In [4]:
from sklearn.model_selection import train_test_split

In [5]:
from sklearn.naive_bayes  import GaussianNB

In [6]:
from sklearn.metrics import accuracy_score

In [7]:
from sklearn.metrics import confusion_matrix

In [60]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [62]:
data['Embarked'].value_counts()

2    644
0    168
1     77
Name: Embarked, dtype: int64

In [63]:
data.describe(include = 'all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891.000000,891.000000,891.000000,891.000000,891,891.000000,204,889.0
unique,NaN,NaN,NaN,891,NaN,NaN,NaN,NaN,681,NaN,147,3.0
top,NaN,NaN,NaN,"Risien, Mr. Samuel Beard",NaN,NaN,NaN,NaN,347082,NaN,G6,2.0
freq,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,7,NaN,4,644.0
mean,446.000000,0.383838,2.308642,NaN,0.647587,29.361582,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,0.477990,13.019697,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,0.000000,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,0.000000,22.000000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,1.000000,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,1.000000,35.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,1.000000,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [64]:
data['Age'].fillna(data['Age'].median(), inplace = True)
data['Embarked'].fillna(data['Embarked'].mode()[0], inplace = True)

In [65]:
le = preprocessing.LabelEncoder()

In [66]:
le.fit(data["Sex"])

LabelEncoder()

In [67]:
print(le.classes_)

[0 1]

In [68]:
data["Sex"]= le.transform(data["Sex"])

In [69]:
data['Embarked'].loc[data['Embarked'] == 'C'] = 0
data['Embarked'].loc[data['Embarked'] == 'Q'] = 1
data['Embarked'].loc[data['Embarked'] == 'S'] = 2

C:\Users\BHUBESH\Anaconda2\lib\site-packages\pandas\core\ops.py:1649: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = method(y)
C:\Users\BHUBESH\Anaconda2\lib\site-packages\pandas\core\indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [70]:
data["Embarked"]

0      2
1      0
2      2
3      2
4      2
5      1
6      2
7      2
8      2
9      0
10     2
11     2
12     2
13     2
14     2
15     2
16     1
17     2
18     2
19     0
20     2
21     2
22     1
23     2
24     2
25     2
26     0
27     2
28     1
29     2
      ..
861    2
862    2
863    2
864    2
865    2
866    0
867    2
868    2
869    2
870    2
871    2
872    2
873    2
874    0
875    0
876    2
877    2
878    2
879    0
880    2
881    2
882    2
883    2
884    2
885    1
886    2
887    2
888    2
889    0
890    1
Name: Embarked, Length: 891, dtype: int64

In [14]:
data["Sex"]

0      1
1      0
2      0
3      0
4      1
5      1
6      1
7      1
8      0
9      0
10     0
11     0
12     1
13     1
14     0
15     0
16     1
17     1
18     0
19     0
20     1
21     1
22     0
23     1
24     0
25     0
26     1
27     1
28     0
29     1
      ..
861    1
862    0
863    0
864    1
865    0
866    0
867    1
868    1
869    1
870    1
871    0
872    1
873    1
874    0
875    0
876    1
877    1
878    1
879    0
880    0
881    1
882    0
883    1
884    1
885    0
886    1
887    0
888    0
889    1
890    1
Name: Sex, Length: 891, dtype: int32

In [71]:
data['Age'].fillna(data['Age'].median() , inplace = True)

In [72]:
y = data["Survived"] # dependent variable

In [73]:
X = data.drop(["Survived" , "PassengerId" , "Name" ,"Cabin","Ticket"] , axis = 1)

In [74]:
y.count()

891

In [75]:
X_train , X_test , y_train , y_test = train_test_split(X,y,test_size = 0.3  ,random_state = 0)

In [76]:
X_train.head()

     Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
857       1    1  51.0      0      0  26.5500         2
52        1    0  49.0      1      0  76.7292         0
386       3    1   1.0      5      2  46.9000         2
124       1    1  54.0      0      1  77.2875         2
578       3    0  28.0      1      0  14.4583         0

In [77]:
data.isnull().any().any()

True

In [78]:
df_vals = data.fillna(0)

In [79]:
X = np.nan_to_num(X)

In [50]:
891*0.3

267.3

In [80]:
from sklearn.naive_bayes import *

In [81]:
clf = BernoulliNB()

In [83]:
y_pred = clf.fit(X_train , y_train ).predict(X_test)

In [84]:
accuracy_score(y_test , y_pred,normalize = True)

0.7835820895522388

In [88]:
confusion_matrix(y_test , y_pred)

array([[137,  31],
       [ 27,  73]], dtype=int64)